In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as plt

In [77]:
df = pd.read_csv('https://raw.githubusercontent.com/WalePhenomenon/climate_change/master/fuel_ferc1.csv')
df.head()

,record_id,utility_id_ferc1,report_year,plant_name_ferc1,fuel_type_code_pudl,fuel_unit,fuel_qty_burned,fuel_mmbtu_per_unit,fuel_cost_per_unit_burned,fuel_cost_per_unit_delivered,fuel_cost_per_mmbtu
0,f1_fuel_1994_12_1_0_7,1,1994,rockport,coal,ton,5377489.0,16.590,18.59,18.53,1.121
1,f1_fuel_1994_12_1_0_10,1,1994,rockport total plant,coal,ton,10486945.0,16.592,18.58,18.53,1.120
2,f1_fuel_1994_12_2_0_1,2,1994,gorgas,coal,ton,2978683.0,24.130,39.72,38.12,1.650
3,f1_fuel_1994_12_2_0_7,2,1994,barry,coal,ton,3739484.0,23.950,47.21,45.99,1.970
4,f1_fuel_1994_12_2_0_10,2,1994,chickasaw,gas,mcf,40533.0,1.000,2.77,2.77,2.570

In [4]:
df.shape

(29523, 11)

# Question 1

In [95]:
A = [1,2,3,4,5,6]
B = [13, 21, 34]

In [98]:
A.extend(B)
A

[1, 2, 3, 4, 5, 6, 13, 21, 34, 13, 21, 34, 13, 21, 34]

# Question 2

In [18]:
np.identity(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

# Question 3

In [19]:
df_group_one = df[['fuel_type_code_pudl','fuel_cost_per_unit_burned']]
df_group_one = df_group_one.groupby(['fuel_type_code_pudl'],as_index=False).mean()
df_group_one

  fuel_type_code_pudl  fuel_cost_per_unit_burned
0                coal                  67.421830
1                 gas                  13.659397
2             nuclear                4955.157002
3                 oil                 168.877086
4               other                  18.253856
5               waste                  19.518122

In [21]:
df_top10 = df_group_one.sort_values(['fuel_cost_per_unit_burned'],ascending=True, axis=0)
df_top10

  fuel_type_code_pudl  fuel_cost_per_unit_burned
1                 gas                  13.659397
4               other                  18.253856
5               waste                  19.518122
0                coal                  67.421830
3                 oil                 168.877086
2             nuclear                4955.157002

# Question 4

In [22]:
df['fuel_mmbtu_per_unit'].describe()

count    29523.000000
mean         8.492111
std         10.600220
min          0.000001
25%          1.024000
50%          5.762694
75%         17.006000
max        341.260000
Name: fuel_mmbtu_per_unit, dtype: float64

# Question 5

In [23]:
df['fuel_qty_burned'].skew()

15.851495469109503

In [92]:
df['fuel_qty_burned'].kurt()

651.3694501337732

# Question 8

In [25]:
df.corr()

,utility_id_ferc1,report_year,fuel_qty_burned,fuel_mmbtu_per_unit,fuel_cost_per_unit_burned,fuel_cost_per_unit_delivered,fuel_cost_per_mmbtu
utility_id_ferc1,1.000000,0.093323,-0.057447,-0.066946,-0.037863,-0.016414,0.006122
report_year,0.093323,1.000000,0.012952,-0.110853,0.013599,-0.014043,0.010261
fuel_qty_burned,-0.057447,0.012952,1.000000,-0.080946,-0.018535,-0.003551,-0.001896
fuel_mmbtu_per_unit,-0.066946,-0.110853,-0.080946,1.000000,-0.010034,-0.009039,-0.005884
fuel_cost_per_unit_burned,-0.037863,0.013599,-0.018535,-0.010034,1.000000,0.011007,-0.000437
fuel_cost_per_unit_delivered,-0.016414,-0.014043,-0.003551,-0.009039,0.011007,1.000000,-0.000109
fuel_cost_per_mmbtu,0.006122,0.010261,-0.001896,-0.005884,-0.000437,-0.000109,1.000000

# Question 10

In [36]:
df_group_one = df[['report_year','fuel_cost_per_unit_delivered']]
df_group_one = df_group_one.groupby(['report_year'],as_index=False).mean()
df_group_one.head()

   report_year  fuel_cost_per_unit_delivered
0         1994                     63.636060
1         1995                     32.735269
2         1996                   9196.705948
3         1997                  11140.197239
4         1998                    287.154420

In [33]:
df_top10 = df_group_one.sort_values(['fuel_cost_per_unit_delivered'],ascending=False, axis=0)
df_top10.head()

    report_year  fuel_cost_per_unit_delivered
3          1997                  11140.197239
2          1996                   9196.705948
6          2000                    985.362877
15         2009                    652.694163
24         2018                    499.269966

# Question 6

In [45]:
missing = df.isnull().sum()
missing

record_id                         0
utility_id_ferc1                  0
report_year                       0
plant_name_ferc1                  0
fuel_type_code_pudl               0
fuel_unit                       180
fuel_qty_burned                   0
fuel_mmbtu_per_unit               0
fuel_cost_per_unit_burned         0
fuel_cost_per_unit_delivered      0
fuel_cost_per_mmbtu               0
dtype: int64

In [48]:
rows = len(df)
rows

29523

In [58]:
missing_percent = ((missing/rows)*100).round(3)
missing_percent

record_id                       0.00
utility_id_ferc1                0.00
report_year                     0.00
plant_name_ferc1                0.00
fuel_type_code_pudl             0.00
fuel_unit                       0.61
fuel_qty_burned                 0.00
fuel_mmbtu_per_unit             0.00
fuel_cost_per_unit_burned       0.00
fuel_cost_per_unit_delivered    0.00
fuel_cost_per_mmbtu             0.00
dtype: float64

**Answer:** <br> **Feature:** fuel_unit, **Total:** 180, **Percent:** 0.61)

# Question 9

In [83]:
df.shape

(29523, 11)

In [84]:
coal_df = df[df['fuel_type_code_pudl'] == 'coal'] 
coal_df

,record_id,utility_id_ferc1,report_year,plant_name_ferc1,fuel_type_code_pudl,fuel_unit,fuel_qty_burned,fuel_mmbtu_per_unit,fuel_cost_per_unit_burned,fuel_cost_per_unit_delivered,fuel_cost_per_mmbtu
0,f1_fuel_1994_12_1_0_7,1,1994,rockport,coal,ton,5377489.0,16.59000,18.590,18.530,1.121
1,f1_fuel_1994_12_1_0_10,1,1994,rockport total plant,coal,ton,10486945.0,16.59200,18.580,18.530,1.120
2,f1_fuel_1994_12_2_0_1,2,1994,gorgas,coal,ton,2978683.0,24.13000,39.720,38.120,1.650
3,f1_fuel_1994_12_2_0_7,2,1994,barry,coal,ton,3739484.0,23.95000,47.210,45.990,1.970
5,f1_fuel_1994_12_2_0_13,2,1994,e. c. gaston-unit 5,coal,ton,2124933.0,23.92200,44.240,43.250,1.850
...,...,...,...,...,...,...,...,...,...,...,...
29503,f1_fuel_2018_12_191_1_14,191,2018,lawrence,coal,ton,1761218.0,17.88832,26.775,27.392,1.497
29510,f1_fuel_2018_12_403_0_2,403,2018,wygen 2,coal,ton,569800.0,16.11000,14.760,0.810,1.130
29516,f1_fuel_2018_12_12_0_8,12,2018,neil simpson unit 2,coal,ton,491913.0,16.10000,14.760,17.720,1.100
29517,f1_fuel_2018_12_12_0_10,12,2018,wyodak - bhp 20%,coal,ton,409637.0,16.06800,13.690,14.310,0.890
29521,f1_fuel_2018_12_12_1_13,12,2018,wygen 3 bhp 52%,coal,ton,315945.0,16.10800,3.060,14.760,1.110

In [87]:
df_group_one = coal_df[['report_year','fuel_cost_per_unit_burned']]
df_group_one = df_group_one.groupby(['report_year'],as_index=False).sum()
df_group_one.head()

   report_year  fuel_cost_per_unit_burned
0         1994                  14984.572
1         1995                  14571.785
2         1996                  12694.803
3         1997                  43742.178
4         1998                  11902.597